[
  {
    "title": "Looking Ahead: Preparing Your Mind for a New Year",
    "date": "December 11, 2024",
    "content": "I am unsure which concept I like more, looking ahead or preparing. Both of these concepts are incredible important in the pursuit of mental health. In my opinion it is very difficult to be mentally healthy without doing both of these things.<>The first concept, looking ahead, is tremendously important. You may be thinking why in the world is important to look ahead, shouldn't I be practicing mindfulness? Yes, of course you should, but we all need goals and purpose. Looking ahead is one way to find those goals that we need to obtain in order to determine our purpose. This is not something that you need to focus on every second of every day, but you should be thinking about where you want to be by the end of next year at the very least.<>Ideally, you have though even further than that. I once did an exercise where I wrote my obituary and then I worked backward from that. Going back in decade long increments I thought about what I wanted my life to look like at each stage of life. This wasn't a depressing exercise, but rather an uplifting one. It helped to see exactly where I wanted to be at each stage of life, and make goals accordingly.<>One of my favorite books is __The Lion Tracker's guide to life__ by Boyd Varty. I re-read this book every year. In it he talks about not always knowing where he is going, but he knows the process to be able to get there. The process of setting goals, and looking ahead helps us to know which actions to take to get to where we ultimately want to get to which is invaluable. This is especially helpful in moments of semi or complete darkness, and it is difficult to see what the next steps in life are.<>The second concept of preparing your mind is just as important as looking ahead. How is it that I can be ready to experience what I want if I am not in the right mindset. For example, if I want a certain outcome, but my mindset exists in a different outcome then I am won't be available to experience that which I have begun to work for. A more tangible example of this is from when I was attending grad school. I was interesting in technology, and wanted to be a part of building something new that would aid in transforming people's lives. To this end I began building technology, eventually creating a couple of startups. The first startup I created prepared me, and assisted me in developing the mindset I needed in order to create my second startup(both of which are still functioning today).<>If I hadn't known where I wanted to go, and began to seek experiences that would develop my mindset then none of those startups would've been possible. This was a direct result of looking ahead and knowing what I wanted my life to look like. I then began seeking out those experiences that would develop my mindset. Experiences that would mold and shape my way of thinking, so that I would be available when the time came to experience that which I have worked so hard for.<>Those are just my examples, and they may not be anything that you are interested in. I totally understand that. This method will work whether you are looking to spend more quality time with family, or whether you want to be the next ruler of the free world. Your mindset is everything when it comes to determining the life around you, and it is difficult to develop that mindset if you do not know where it is that you want to go.<>As the new year approaches do yourself a favor and find a place where you can be quiet for a little bit. The amount of time however long you can afford to be away from others for. For some this may be an hour, for some this could be 5 minutes. Either way make that time. If it is 5 minutes take the time, and do it over the course of a few days. Use that time to determine what it is you want your life to look like over the next year. Write out in as much detail as possible exactly what it is that you are looking for. After that write out some goals that will help you begin to achieve those goals. Once you have achieved those goals keep going. Write some more, and no matter what keep taking action towards what it is that you want. One of the most comforting thoughts for me is that I may not reach all my goals, but I know for a fact that no one can take away the fact that I used every day of my life to attempt to achieve my goals."  
  },
  {
    "title": "Prioritizing Mental Wellness During Busy Seasons",
    "date": "December 6, 2024",
    "content": "Prioritizing mental wellness during busy seasons is, as far as I am concerned, a controversial topic. You may be thinking why in the world would this be controversial? Isn't this supposed to be what I am doing? This is what people are telling me to do, are you telling me that I shouldn't?<>No, I am not disagreeing with anyone, nor am I telling you that you should not prioritize your mental wellness during the holidays. I find this controversial because your mental wellbeing should be a priority all throughout the year not just during the holidays. If your anything like me I do not experience mental discomfort on during the holiday season. I experience it constantly throughout the year.<>It is important to note a couple of things from the prior statements. Number one being that mental health should be a priority. I did not state that mental health should be the priority. At some points in time it is going to become complicated to put your mental health first at all points in time. Life happens and you are going to need to prioritize other tasks given the situation. Make sure that you are addressing those events that need to take precedence. For example, if I there is an issue that arise with my kid that requires my immediate attention, but I tell myself I need to prioritize my mental health the situation will only end poorly. Why? because addressing the situation in that moment is a part of me being mentally healthy. If I ignore the situation I am only deteriorating my mental wellbeing by avoiding the situation that is demanding my attention.<>All that being said being healthy is incredibly important for many things related to the holidays. It assists us in showing up for family, in enjoying whatever is going on around us, and it is difficult to show up the way we need to if we are not mentally healthy. However, one of the best ways to remain mentally healthy is by dealing with the unexpected happenings of life as they arise. Procrastination is the worst thing one can do when it comes to remaining mentally healthy. If we look at the prior example I gave, that situation is going to sit in the back of my mind, and annoy me like a gnat until I get up and take care of it. There is no way short of turning to distractions like social media, tv, alcohol, etc. to not have those things we need to do in the back of our mind.<>The beautiful thing about, and quite possibly the most infuriating thing, about the human mind is it tends to know exactly what it needs in order to be healthy (or move forward). This makes it easy to identify the problem, and the solution, but it also makes it incredibly difficult if you are not in a willing state of mind to address those issues.<>I relay to everyone I have ever worked with in this lifetime that willingness is 80% of the battle. If I remain willing then it makes no difference if I address my mental issue right away, or in a day or two because I am not avoiding it. Avoidance is the quickest and most effective way to mental illness. Both fortunately, and unfortunately, we live in a era of distraction. It is super easy to pick up a phone and open a social media app where distractions are abundant. I am not trying to demonize distractions because there is a time where they play a vital role. As with everything there is a time and a place for a distraction and it is up to us to identify those times. Remember, our mind knows the difference between us facing our mental struggles head on, and when we are just trying to act like they don't exist.<>When prioritizing mental wellness during the holidays the important thing to remember is just to be willing to put your mental wellbeing as one of your priorities. This is the most effective way to make sure that you are able to address all the challenges of the holidays, while also maintaining your mental wellbeing. You may be thinking that it sounds like complete BS, but to that I would say don't knock it till your try it. Become completely willing, the key word being completely, not 40, 50 or 70% willing. If you can become completely willing to making your mental wellbeing a priority then you will be amazed at what you can handle during the holidays."
  },
  {
    "title": "How to Say No Without Feeling Guilty",
    "date": "December 4, 2024",
    "content": "I am going to start this out with an underrated quote that many know all too well, \"Just do it\" (Seriously, I never would've thought of that). I know it seems simple, and saying no is that simple. However, this is not where the difficulty arises when agreeing, or not agreeing, to give up your valuable time during the holidays.<>Typically, the guilt that is experienced when either saying no, or not saying no stems from some element of trauma. In reality saying no to anyone is not a big deal, and many will not even bat an eyelash if you state you aren't able to attend an event. If they do chances are they have some unresolved trauma themselves (SHOCKER). Happy Healthy humans are not going to berate you, think less of you, or manipulate you because you are too busy during one of the busiest times of the year to make their holiday cookie party. That being said if you bail on people regularly, and your friends haven't seen you in months because you say no all the time this is a different beast entirely.<>I think we have hit on the most important thing which becomes more challenging during these times, especially if you have a history of struggling with mental health. That idea is being a happy healthy human. Sounds super easy, but as someone who struggled with mental health for over a decade it is nowhere near as easy as it sounds.<>I remember when I was young thinking why am I not happy? Why do I always want to be someone else? Why is what I have not good enough? These were hard questions to answer. It took me over a decade to address them because of them were neurological, not mental. I had suffered a few blows to the head growing up that significantly impacted my mental wellbeing. It took a long time to realize this, and to find the solution that would help me overcome these obstacles (The trick was increasing blood flow and Oxygen to my brain, I still have the book that helped me with this). Something as simple as just be happy, or just say no becomes incredibly challenging when your brain is not functioning the way that it should be.<>The solution start the journey towards becoming mentally healthy today. Don't start tomorrow do it right now. Make the commitment, and decide the first steps to get there. The road to becoming a happy healthy human does not happen overnight. As they say Rome was not built in a day, but it was built brick by brick. Anyone can overcome significant mental health challenges one step at a time. The first step can be as small as telling a loved one you are struggling, and thinking about getting help. It can be as big as scheduling an appointment with a therapist, a psychologist, or a social worker. Any step you take no matter how big or small will aid you in your journey to becoming a happy healthy human. Please take the first step now, you will thank you for it."
  },
  {
    "title": "Managing Holiday Stress",
    "date": "December 4, 2024",
    "content": "The holidays are a difficult time for so many of us, myself included. This time of year is especially complicated being that there are so many holidays back to back. Thanksgiving, Christmas, New Years all happening within a month of each other. This is a lot to process for anyone, let alone if you are a member of the neurodivergent community.<>If your family is anything like mine then that means that it is not only one day of celebration for these holidays, but many days of celebration for the holidays. For Thanksgiving alone we had three days of celebrations (Imagine the Christmas holiday, which is much more important in my family). This is far from a complaint because I do love my family and appreciate their company, but this is a lot of personalities for myself to deal with.<>Just a few years ago this was far too much for me to deal with. I would typically have a combination of not going to some of the events, while also spending as little time as I needed to in order to be considered as an attendee of the event. This is not anything that I am proud of, but being around family for that amount of time was simply a lot of stress.<>I have addressed the stress of family, but unfortunately this is not the only stressors that we experience around this time of year. Financial pressures mount because if you celebrate Christmas there are presents that must be bought. This is typically an expense that is outside of your normal expenses, and requires some extra budgeting in order for it to be managed effectively.<>In addition to the prior two stressors there is also the stress induced by the change in environment. Where I live the weather not only gets significantly colder, but also considerably darker. Whereas I am used to it being light until 7 at night, suddenly it is dark by 4. This change can lead to seasonal depression in some, which is no laughing matter.<>I know what you may be thinking, \"Hey A-hole, its great you have identified all these issues, but is there a solution\". Of course I have some solutions. There may even be one works for you (at least that is my hope). One solution that I rely on is to remember that I still have needs that must be addressed during the holidays. Personally, I am an introvert, so I need my alone time in order to process the world around me. I must take time for myself in order to go for a walk, or read a book. If not the holidays just got one step closer to being overwhelming.<>You may be thinking what if I am not that self-aware yet. That's ok, take a brief inventory before the holidays begin. Ask yourself the question in quiet contemplation, what do I need in order to relax during the holidays? Ask yourself how you can remain level headed throughout the holidays. You have the answers inside, you simply need to bring them into your awareness. You will be amazed if you sit down and ask yourself the questions about the things that bother you the most during the holidays. The answers will come almost immediately if you can sit quietly enough. This does not mean traditional meditation, it just means to sit or walk with no distractions. That means no phone, no other technological devices, and also doing it in solitude. I know the later may be complicated for some, especially single parents, but take 5 minutes when your kids go to sleep, and take this inventory. You will thank yourself for doing it.<>My favorite strategy to use during the holidays is to find a way to be of service. This can be of service to your family, or you can do things for others in your community. This is such an underrated strategy to avoid feeling overwhelmed. When we exist inside of our own bubble it is easy to see our bubble as all there is. Being of service to those around you tends to put everything in perspective, and allow you to appreciate the little things in your life. I personally find ways to be of service at family functions because there are few better ways to stop thinking about myself, than to think about what I can do for other people.<>The holidays are most certainly a stressful time, and very quickly can become overwhelming. However, just because they can be stressful, or they can be overwhelming does not mean that they have to be. Even if you have never had a positive family interaction during the holidays for over two decades it is never too late to form new habits, and begin enjoying the holidays again."
  },
  {
    "title": "Navigating Family Dynamics During the Holidays",
    "date": "November 20, 2024",
    "content": "Family dynamics are quite the foray into emotional and mental resilience. For so many years the struggle with family dynamics were a plague that I was determined to stay far away from. However, since the birth of my first child I was forced to rethink those my approach to those dynamics.<>Don't get me wrong there are very few things that make the dynamics of family easier, but that doesn't mean that they are destined to be unpleasant forever. As I have spoken about in prior posts I do believe that this is a matter of walking in with the right mindset.<>I am hoping that it is painfully obvious that mindset is not a cure all penicillin. There is no way to will away generational patterns. That comes with hard work and addressing those deep rooted emotions that can send us into a pattern of seething rage, or decapitating depression. That being said that doesn't mean that you have to avoid your family while working through these deep rooted psychological complications.<>If the first thought I have when going to see my family is \"Oh no, this is going to be awful\", then the chances of that wonderful family that only wants the best for me is going to push my buttons the wrong way will jump exponentially higher. If I approach the situation with love, kindness, and excitement then it is much less likely that those same wonderful people will hit those buttons on purpose. There may be an accident here and there, but those moments happen considerably less with the right mindset.<>Family is one of the greatest gifts that any human can have. They are people who will show up for you when things are darkest. They are the only people who stick around for the majority of life, and not simply be there for a year or two at most like many of the humans we will interact with throughout our lives. To pay homage to the prior post having that attitude of gratitude for those people who will be there through thick and thin will forever change the way that you interact with your loved ones."
  },
  {
    "title": "How to Reflect on the Year Without Self-Judgment",
    "date": "November 19, 2024",
    "content": "\"An unexamined life is not worth living\". What a message from everyones favorite 5th century BCE philosopher. Who would of thought when he uttered these sagacious words that they would stick around for a few thousand years. Which in my mind leads me to deduce that this must be an incredibly important statement that can have profound impacts on ones life.<>That being said reflection can come with serious issues if not done with care. Typically, with care for oneself. It is incredibly easy to look down on oneself for not being good enough, smart enough, for making silly mistakes, etc. The list goes on and on, and the possibilities of judgmental reflection are far too many to list here.<>One thing that I do everything within my power to do is look at my life with absolutely no judgment at all. Now I know what your thinking, \"F this guy, its not easy\". That assessment would be accurate. However, I have found that it is typically related to mindset. Personally, my mindset determines the level of judgment in my self-reflection.<>One thing that I continually remind myself is that nothing that I do in this lifetime is good or bad. It simply isn't that black and white. This thought in and of itself is super helpful in reflecting on life in a non-critical manner. Based on the actions that I take, there are reactions (consequences, but I dislike this word) that I like, and reactions (again substitute consequences if you want) that I don't like. Due to this fact it is imperative that I analyze life each day.<>Personally, I have a tendency to over examine my life, which I am in no way shape or form advocating for. This is enough to drive any sane person insane very quickly. However, I have an uncanny ability to look at that same life with absolutely no judgment. This lack of judgment affords me the ability to remain in the mindset that I want to be in. It allows me to make changes in my life that are beneficial to keeping that mindset. That keep my mind from deteriorating to a level that I find unacceptable. Allowing me to avoid the depths of despair that plagued me as an adolescent, and young adult.<>Examine your life, its great for you. Do so with the understanding that all things are neither good nor bad, they simply have reactions(or consequences) that you want or don't. As soon as you determine which reactions you want keep taking those actions. It will aid you in building the life that you want to live. While Rome may not have been built in a day, it was built brick by brick, which is all you need to do to build a better, healthier life.<>"
  },
  {
    "title": "The Mental Health Benefits of Practicing Gratitude",
    "date": "November 17, 2024",
    "content": "Practicing Gratitude is something that I always thought was absolutely ridiculous. I remember many times throughout my life people telling me to have an \"attitude of gratitude\". At that same moment I remember thinking \"F**k you, thats a bunch of phooey\". I understand that its good to be grateful for what you have, but me telling myself I am grateful for something is not going to do anything in my life.<>Most of the people who I saw running around telling me how grateful they were seemed like they were full of bologna. It seemed so fake and phony, and I wanted absolutely nothing to do gratitude. Maybe it wasn't gratitude that I didn't want anything to do with, but rather that I wanted nothing to do with what I believed to be inauthentic words that couldn't possibly affect my daily living.<>Over a decade later I now realize how wrong I truly was. Not about the lack of authenticity from those preaching gratitude, but wrong about the fact that the act of listing things one is grateful for has a profound impact on our daily lives.<>One of the big problems with gratitude is that it is not immediate. It takes time for the daily gratitude practice to begin to produce an effect. Being an impatient human that was a hard pill to swallow. However, once ones mindset begins to shift towards gratitude Amazing things begin to happen. The circumstances of life will begin to shift, but this takes even longer than he mind.<>The best thing that comes from having an attitude of gratitude is that for the first time in my life, I have been able to sit back and say that I am happy. To come from some of the darkest recesses of the human mind where there is nothing other than a black abyss swallowing us on a day to day basis to being able to say I am happy for the first time in my life is a major shift. It is a shift that is worth every day that I practiced gratitude and saw absolutely no results. It made the years that I spent ignoring gratitude because of its alleged lack of authenticity worth it because now I would not go a single day without finding something to be grateful for.<>Gratitude produces such a strong mental shift that it should never be understated. You may run into someone who you think is full of bologna, spouting off all kinds of ridiculous things they are grateful for. That's ok, join them. Embrace the phony act of faking it till you make it. Whatever you do, just practice being grateful for the things around you because eventually it is inevitable that your mindset will shift, and your life will become something that you no longer recognize in the best way possible."
  }
]